<!-- add-pr-comment:add-pr-comment -->

## Terraform auth0 (operations-engineering-test) plan
```
auth0_tenant.tenant: Refreshing state... [id=db796dd0-9670-4641-85bb-b6462e3ab6a9]
auth0_attack_protection.attack_protection: Refreshing state... [id=f9e2376d-c64d-44ec-9a34-04b65dabb0ca]
auth0_connection.google_oauth2: Refreshing state... [id=con_yyrB18AQbSUcMLTm]
auth0_resource_server.auth0_management_api: Refreshing state... [id=65942c8d2208302c27c666f4]
auth0_client.terraform_provider_auth0: Refreshing state... [id=xI46sB1af7TKeycQ3xfTA2qIxeLiX2R8]
auth0_connection.google_workspace: Refreshing state... [id=con_VacE1q5yZxznHQAj]
auth0_client.github: Refreshing state... [id=Ez0SbR2tPwaDgL6tjWALIKSy4m3WtSFr]
auth0_client.default_app: Refreshing state... [id=qkvVnu0b4pXd6FdEbjm073w4MchhpOoB]
auth0_connection_client.google_workspace_github: Refreshing state... [id=con_VacE1q5yZxznHQAj::Ez0SbR2tPwaDgL6tjWALIKSy4m3WtSFr]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # auth0_client.github will be created
  + resource "auth0_client" "github" {
      + allowed_clients                       = []
      + allowed_logout_urls                   = []
      + allowed_origins                       = []
      + app_type                              = "regular_web"
      + callbacks                             = [
          + "https://github.com/orgs/ministryofjustice-test/saml/consume",
        ]
      + client_aliases                        = []
      + client_id                             = (known after apply)
      + cross_origin_auth                     = true
      + custom_login_page_on                  = true
      + description                           = "Web application to SSO into the ministryofjustice-test GitHub Organisation"
      + grant_types                           = [
          + "authorization_code",
          + "implicit",
          + "refresh_token",
          + "client_credentials",
        ]
      + id                                    = (known after apply)
      + is_first_party                        = true
      + is_token_endpoint_ip_header_trusted   = false
      + name                                  = "GitHub"
      + oidc_conformant                       = true
      + organization_require_behavior         = "no_prompt"
      + require_pushed_authorization_requests = false
      + signing_keys                          = (sensitive value)
      + sso                                   = false
      + sso_disabled                          = false
      + web_origins                           = []

      + addons {
          + samlp {
              + create_upn_claim                   = true
              + digest_algorithm                   = "sha256"
              + include_attribute_name_format      = true
              + lifetime_in_seconds                = 3600
              + map_identities                     = false
              + map_unknown_claims_as_is           = false
              + mappings                           = {
                  + "email"   = "emails"
                  + "name"    = "full_name"
                  + "user_id" = "http://schemas.xmlsoap.org/ws/2005/05/identity/claims/nameidentifier"
                }
              + name_identifier_format             = "urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified"
              + name_identifier_probes             = [
                  + "http://schemas.xmlsoap.org/ws/2005/05/identity/claims/nameidentifier",
                ]
              + passthrough_claims_with_no_mapping = false
              + signature_algorithm                = "rsa-sha256"
              + typed_attributes                   = true
            }
        }

      + jwt_configuration {
          + alg                 = "RS256"
          + lifetime_in_seconds = 36000
          + secret_encoded      = false
        }

      + native_social_login {
          + apple {
              + enabled = false
            }
          + facebook {
              + enabled = false
            }
        }

      + refresh_token {
          + expiration_type              = "non-expiring"
          + idle_token_lifetime          = 2592000
          + infinite_idle_token_lifetime = true
          + infinite_token_lifetime      = true
          + leeway                       = 0
          + rotation_type                = "non-rotating"
          + token_lifetime               = 31557600
        }
    }

  # auth0_connection_client.google_workspace_github will be created
  + resource "auth0_connection_client" "google_workspace_github" {
      + client_id     = (sensitive value)
      + connection_id = "con_VacE1q5yZxznHQAj"
      + id            = (known after apply)
      + name          = (known after apply)
      + strategy      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```